nsec/nsec-badge/nrf52/src/app/game_mines.c
//  Copyright (c) 2018-2019
//  NorthSec badge team <https://github.com/nsec>
//
//  License: MIT (see LICENSE for details)

#include <stdint.h>
#include <string.h>

#include <app_timer.h>
#include <nrf_delay.h>

#include "application.h"
#include "drivers/controls.h"
#include "drivers/display.h"
#include "game_mines.h"
#include "gfx_effect.h"
#include "random.h"

#include "images/external/mines_background_bitmap.h"
#include "images/external/mines_controls_bitmap.h"
#include "images/external/mines_level_1_active_bitmap.h"
#include "images/external/mines_level_1_bitmap.h"
#include "images/external/mines_level_2_active_bitmap.h"
#include "images/external/mines_level_2_bitmap.h"
#include "images/external/mines_level_3_active_bitmap.h"
#include "images/external/mines_level_3_bitmap.h"
#include "images/external/mines_menu_bitmap.h"
#include "images/external/mines_message_bitmap.h"
#include "images/external/mines_sidebar_bitmap.h"
#include "images/external/mines_sidebar_warning_bitmap.h"
#include "images/external/mines_splash_bitmap.h"
#include "images/mines_flag_bitmap.xbm"
#include "images/mines_pattern_1_bitmap.h"
#include "images/mines_pattern_2_bitmap.h"
#include "images/mines_pattern_3_bitmap.h"
#include "images/mines_pattern_4_bitmap.h"
#include "images/mines_pattern_5_bitmap.h"
#include "images/mines_pattern_6_bitmap.h"
#include "images/mines_pattern_7_bitmap.h"
#include "images/mines_pattern_8_bitmap.h"
#include "images/mines_pattern_blank_bitmap.h"
#include "images/mines_pattern_boom_bitmap.h"
#include "images/mines_pattern_cleared_bitmap.h"
#include "images/mines_pattern_flag_bitmap.h"
#include "images/mines_pattern_hold_bitmap.h"
#include "images/mines_pattern_mine_bitmap.h"

#define MINES_BUTTON_NONE 255

#define MINES_GAME_CELL2LIST(x, y) y * p_state->field_width + x
#define MINES_GAME_LIST2CELL_X(value) value % p_state->field_width
#define MINES_GAME_LIST2CELL_Y(value) value / p_state->field_width

#define MINES_GAME_FIELD_CELL 9
#define MINES_GAME_FIELD_SIDEBAR_POSITION 120
#define MINES_GAME_FIELD_SIZE (p_state->field_width * p_state->field_height)

#define MINES_GAME_GOTO(new_state) p_state->current_state = new_state

#define MINES_GAME_LIST_LIMIT (11 * 8 - 20)

#define MINES_GAME_STATE_BOOT 1
#define MINES_GAME_STATE_BOOT_SPLASH 2
#define MINES_GAME_STATE_MENU 3
#define MINES_GAME_STATE_CONTROLS 4
#define MINES_GAME_STATE_MANUAL 5
#define MINES_GAME_STATE_SELECT_LEVEL 6
#define MINES_GAME_STATE_INIT_GAME 7
#define MINES_GAME_STATE_DRAW_CANVAS 8
#define MINES_GAME_STATE_GAME 9
#define MINES_GAME_STATE_EXPLOSION 10
#define MINES_GAME_STATE_EXPLOSION_MSG 11
#define MINES_GAME_STATE_CLEARED 12
#define MINES_GAME_STATE_CLEARED_MSG 13
#define MINES_GAME_STATE_POST_MENU 14
#define MINES_GAME_STATE_FLAG 15
#define MINES_GAME_STATE_EXIT 255

#define MINES_PATTERN_BLANK 128
#define MINES_PATTERN_BOOM 129
#define MINES_PATTERN_CLEARED 130
#define MINES_PATTERN_FLAG 131
#define MINES_PATTERN_HOLD 132
#define MINES_PATTERN_MINE 133

#define MINES_TIMER_INTERVAL 10

#define MINES_TIMER_CANCEL(timer) p_state->timer_##timer = 0
#define MINES_TIMER_ENDED(timer) p_state->timer_##timer == 0
#define MINES_TIMER_START(timer, end)                                          \
    p_state->timer_##timer = end / MINES_TIMER_INTERVAL
#define MINES_TIMER_TICK(timer) p_state->timer_##timer--

APP_TIMER_DEF(mines_timer_id);

static uint8_t mines_button_read_value = MINES_BUTTON_NONE;

static uint8_t mines_difficulty_levels[3][3] = {
    {5, 5, 5}, {7, 7, 10}, {11, 8, 20}};
//                           ^  ^  ^
//               field width +  |  |
//              field height -  +  |
//           number of mines -  -  +

typedef struct MinesBorderingCells {
    uint8_t cells[8];
    uint8_t count;
} MinesBorderingCells;

typedef struct MinesGameState {
    uint8_t opened[MINES_GAME_LIST_LIMIT];
    uint8_t mines[MINES_GAME_LIST_LIMIT];
    uint8_t holds[MINES_GAME_LIST_LIMIT];
    uint8_t flags[MINES_GAME_LIST_LIMIT];

    uint8_t current_difficulty;
    uint8_t current_state;
    bool cursor_activated;
    uint8_t cursor_x;
    uint8_t cursor_y;
    uint8_t field_height;
    uint8_t field_width;
    uint8_t flags_placed;
    uint8_t holds_placed;
    uint8_t mines_total;
    uint8_t opened_count;

    bool cleared_rendered;
    bool controls_rendered;
    bool explosion_rendered;
    uint8_t manual_position;
    bool manual_rendered;
    uint8_t menu_position;
    bool menu_rendered;
    bool select_level_highlight;
    bool select_level_rendered;
    uint8_t sidebar_warning_hold;

    uint16_t timer_button;
    uint16_t timer_cursor;
    uint16_t timer_select_level_highlight;
    uint16_t timer_sidebar;

    void (*long_button_cb)(void *p);
    void (*short_button_cb)(void *p);
} MinesGameState;

static void mines_ui_draw_cell_pattern(uint8_t x, uint8_t y, uint8_t pattern_id)
{
    switch (pattern_id) {
    case 0:
        gfx_fill_rect(x - 1, y - 1, MINES_GAME_FIELD_CELL + 1,
                      MINES_GAME_FIELD_CELL + 1, 0xce79);
        break;

    case 1:
        gfx_draw_16bit_bitmap(x - 1, y - 1, &mines_pattern_1_bitmap, 0);
        break;

    case 2:
        gfx_draw_16bit_bitmap(x - 1, y - 1, &mines_pattern_2_bitmap, 0);
        break;

    case 3:
        gfx_draw_16bit_bitmap(x - 1, y - 1, &mines_pattern_3_bitmap, 0);
        break;

    case 4:
        gfx_draw_16bit_bitmap(x - 1, y - 1, &mines_pattern_4_bitmap, 0);
        break;

    case 5:
        gfx_draw_16bit_bitmap(x - 1, y - 1, &mines_pattern_5_bitmap, 0);
        break;

    case 6:
        gfx_draw_16bit_bitmap(x - 1, y - 1, &mines_pattern_6_bitmap, 0);
        break;

    case 7:
        gfx_draw_16bit_bitmap(x - 1, y - 1, &mines_pattern_7_bitmap, 0);
        break;

    case 8:
        gfx_draw_16bit_bitmap(x - 1, y - 1, &mines_pattern_8_bitmap, 0);
        break;

    case MINES_PATTERN_BLANK:
        gfx_draw_16bit_bitmap(x - 1, y - 1, &mines_pattern_blank_bitmap,
                                      0);
        break;

    case MINES_PATTERN_BOOM:
        gfx_draw_16bit_bitmap(x - 2, y - 2, &mines_pattern_boom_bitmap,
                                      0);
        break;

    case MINES_PATTERN_CLEARED:
        gfx_draw_16bit_bitmap(x, y, &mines_pattern_cleared_bitmap, 0);
        break;

    case MINES_PATTERN_FLAG:
        gfx_draw_16bit_bitmap(x, y, &mines_pattern_flag_bitmap, 0);

        break;
    case MINES_PATTERN_HOLD:
        gfx_draw_16bit_bitmap(x, y, &mines_pattern_hold_bitmap, 0);
        break;

    case MINES_PATTERN_MINE:
        gfx_draw_16bit_bitmap(x, y, &mines_pattern_mine_bitmap, 0);
        break;
    }
}

static void mines_ui_draw_cursor(uint8_t x, uint8_t y, uint8_t variant)
{
    uint16_t color = 0xf000;

