nsec/nsec-badge/nrf52/src/app/game_mines.c
    if (variant == 1) {
        color = 0xffff;
    } else if (variant == 2) {
        color = 0xce79;
    }

    gfx_draw_rect(x, y, MINES_GAME_FIELD_CELL - 1, MINES_GAME_FIELD_CELL - 1,
                  color);
}

static void mines_buttons_handle(button_t button)
{
    mines_button_read_value = button;
}

static uint8_t mines_buttons_read()
{
    if (mines_button_read_value != MINES_BUTTON_NONE) {
        uint8_t value = mines_button_read_value;
        mines_button_read_value = MINES_BUTTON_NONE;

        return value;
    }

    return MINES_BUTTON_NONE;
}

static uint8_t mines_buttons_is_any_pushed()
{
    switch (mines_buttons_read()) {
    case BUTTON_BACK:
    case BUTTON_DOWN:
    case BUTTON_ENTER:
    case BUTTON_UP:
        return true;

    default:
        return false;
    }
}

static void mines_calculate_bordering_cells(
    uint8_t x, uint8_t y, MinesBorderingCells *p_cells, MinesGameState *p_state,
    bool (*filter)(MinesGameState *p_state, uint8_t value))
{
    uint8_t bottom = y == p_state->field_height - 1 ? y : y + 1;
    uint8_t left = x == 0 ? 0 : x - 1;
    uint8_t right = x == p_state->field_width - 1 ? x : x + 1;
    uint8_t top = y == 0 ? 0 : y - 1;
    uint8_t value;

    for (uint8_t i = left; i <= right; i++) {
        for (uint8_t j = top; j <= bottom; j++) {
            value = MINES_GAME_CELL2LIST(i, j);

            if (i == x && j == y)
                continue;

            if (filter && !filter(p_state, value))
                continue;

            p_cells->cells[p_cells->count] = value;
            p_cells->count++;
        }
    }
}

static void mines_calculate_cell_origin(uint8_t x, uint8_t y, uint8_t width,
                                        uint8_t height, uint8_t *origin_x,
                                        uint8_t *origin_y)
{
    uint8_t offset_x =
        (MINES_GAME_FIELD_SIDEBAR_POSITION - width * MINES_GAME_FIELD_CELL) / 2;
    uint8_t offset_y = (80 - height * MINES_GAME_FIELD_CELL) / 2;

    *origin_x = offset_x + x * MINES_GAME_FIELD_CELL;
    *origin_y = offset_y + y * MINES_GAME_FIELD_CELL + 1;
}

static bool mines_is_in_list(uint8_t list[], uint8_t tail, uint8_t value)
{
    for (uint8_t i = 0; i < tail; i++) {
        if (list[i] == value) {
            return true;
        }
    }

    return false;
}

static void mines_add_to_list(uint8_t list[], uint8_t *tail, uint8_t value)
{
    if (!mines_is_in_list(list, *tail, value)) {
        list[*tail] = value;
        (*tail)++;
    }
}

static void mines_remove_from_list(uint8_t list[], uint8_t *tail, uint8_t value)
{
    uint8_t i = 0, t = *tail;

    for (; i < t; i++) {
        if (list[i] == value) {
            for (uint8_t j = i + 1; j < t; j++) {
                list[j - 1] = list[j];
            }

            (*tail)--;
        }
    }
}

static bool mines_game_has_flag_at(MinesGameState *p_state, uint8_t value)
{
    return mines_is_in_list(p_state->flags, p_state->flags_placed, value);
}

static bool mines_game_has_hold_at(MinesGameState *p_state, uint8_t value)
{
    return mines_is_in_list(p_state->holds, p_state->holds_placed, value);
}

static bool mines_game_has_mine_at(MinesGameState *p_state, uint8_t value)
{
    return mines_is_in_list(p_state->mines, p_state->mines_total, value);
}

static bool mines_game_is_opened(MinesGameState *p_state, uint8_t value)
{
    return mines_is_in_list(p_state->opened, p_state->opened_count, value);
}

static void mines_clear_cursor(MinesGameState *p_state)
{
    uint8_t origin_x, origin_y;

    if (p_state->cursor_activated) {
        mines_calculate_cell_origin(p_state->cursor_x, p_state->cursor_y,
                                    p_state->field_width, p_state->field_height,
                                    &origin_x, &origin_y);

        if (mines_game_is_opened(
                p_state,
                MINES_GAME_CELL2LIST(p_state->cursor_x, p_state->cursor_y))) {
            mines_ui_draw_cursor(origin_x, origin_y, 2);
        } else {
            mines_ui_draw_cursor(origin_x, origin_y, 1);
        }

        p_state->cursor_activated = false;
        MINES_TIMER_CANCEL(cursor);
    }
}

static void mines_game_action_flag(void *p)
{
    MinesGameState *p_state = (MinesGameState *)p;

    mines_clear_cursor(p_state);

    uint8_t origin_x, origin_y;
    mines_calculate_cell_origin(p_state->cursor_x, p_state->cursor_y,
                                p_state->field_width, p_state->field_height,
                                &origin_x, &origin_y);

    uint8_t value = MINES_GAME_CELL2LIST(p_state->cursor_x, p_state->cursor_y);

    if (mines_game_has_hold_at(p_state, value)) {
        mines_remove_from_list(p_state->holds, &p_state->holds_placed, value);
        mines_ui_draw_cell_pattern(origin_x, origin_y, MINES_PATTERN_BLANK);
    } else if (mines_game_has_flag_at(p_state, value)) {
        mines_remove_from_list(p_state->flags, &p_state->flags_placed, value);
        mines_add_to_list(p_state->holds, &p_state->holds_placed, value);
        mines_ui_draw_cell_pattern(origin_x, origin_y, MINES_PATTERN_HOLD);
    } else {
        mines_add_to_list(p_state->flags, &p_state->flags_placed, value);
        mines_ui_draw_cell_pattern(origin_x, origin_y, MINES_PATTERN_FLAG);
    }
}

static void mines_game_action_flags_warn(void *p)
{
    MinesGameState *p_state = (MinesGameState *)p;

    p_state->sidebar_warning_hold = 3;
    MINES_TIMER_CANCEL(sidebar);
}

static void mines_game_action_move_down(void *p)
{
    MinesGameState *p_state = (MinesGameState *)p;

    if (p_state->cursor_y < p_state->field_height - 1) {
        mines_clear_cursor(p_state);
        p_state->cursor_y++;
    }
}

static void mines_game_action_move_left(void *p)
{
    MinesGameState *p_state = (MinesGameState *)p;

    if (p_state->cursor_x > 0) {
        mines_clear_cursor(p_state);
        p_state->cursor_x--;
    }
}

static void mines_game_action_move_right(void *p)
{
    MinesGameState *p_state = (MinesGameState *)p;

    if (p_state->cursor_x < p_state->field_width - 1) {
        mines_clear_cursor(p_state);
        p_state->cursor_x++;
    }
}

static void mines_game_action_move_up(void *p)
{
    MinesGameState *p_state = (MinesGameState *)p;

