nsec/nsec-badge/nrf52/src/app/game_mines.c
    if (p_state->cursor_y > 0) {
        mines_clear_cursor(p_state);
        p_state->cursor_y--;
    }
}

static void mines_game_action_open(void *p)
{
    MinesGameState *p_state = (MinesGameState *)p;

    mines_clear_cursor(p_state);

    uint8_t origin_x, origin_y;
    uint8_t value = MINES_GAME_CELL2LIST(p_state->cursor_x, p_state->cursor_y);

    mines_calculate_cell_origin(p_state->cursor_x, p_state->cursor_y,
                                p_state->field_width, p_state->field_height,
                                &origin_x, &origin_y);

    if (mines_game_has_flag_at(p_state, value)) {
        mines_remove_from_list(p_state->flags, &p_state->flags_placed, value);
        mines_ui_draw_cell_pattern(origin_x, origin_y, MINES_PATTERN_BLANK);
    } else if (mines_game_has_hold_at(p_state, value)) {
        mines_remove_from_list(p_state->holds, &p_state->holds_placed, value);
        mines_ui_draw_cell_pattern(origin_x, origin_y, MINES_PATTERN_BLANK);
    } else if (mines_game_has_mine_at(p_state, value)) {
        mines_ui_draw_cell_pattern(origin_x, origin_y, MINES_PATTERN_MINE);
        MINES_GAME_GOTO(MINES_GAME_STATE_EXPLOSION);
    } else {
        mines_add_to_list(p_state->opened, &p_state->opened_count, value);

        MinesBorderingCells mines_arround = {};

        mines_calculate_bordering_cells(p_state->cursor_x, p_state->cursor_y,
                                        &mines_arround, p_state,
                                        mines_game_has_mine_at);

        mines_ui_draw_cell_pattern(origin_x, origin_y, mines_arround.count);
    }

    gfx_update();
}

static void mines_game_state_game_task_buttons(MinesGameState *p_state)
{
    uint8_t value = MINES_GAME_CELL2LIST(p_state->cursor_x, p_state->cursor_y);

    switch (mines_buttons_read()) {
    case BUTTON_BACK:
        p_state->long_button_cb = NULL;
        p_state->short_button_cb = mines_game_action_move_left;

        if (!mines_game_is_opened(p_state, value)) {
            MINES_TIMER_START(button, 666);
            p_state->long_button_cb = mines_game_action_open;
        }

        break;

    case BUTTON_DOWN:
        p_state->long_button_cb = NULL;
        p_state->short_button_cb = mines_game_action_move_down;
        break;

    case BUTTON_ENTER:
        p_state->long_button_cb = NULL;
        p_state->short_button_cb = mines_game_action_move_right;

        if (mines_game_has_flag_at(p_state, value) ||
            mines_game_has_hold_at(p_state, value)) {
            MINES_TIMER_START(button, 666);
            p_state->long_button_cb = mines_game_action_flag;
        } else if (!mines_game_is_opened(p_state, value)) {
            uint8_t total_flagged =
                p_state->flags_placed + p_state->holds_placed;

            MINES_TIMER_START(button, 666);
            if (total_flagged < p_state->mines_total) {
                p_state->long_button_cb = mines_game_action_flag;
            } else {
                p_state->long_button_cb = mines_game_action_flags_warn;
            }
        }

        break;

    case BUTTON_UP:
        p_state->long_button_cb = NULL;
        p_state->short_button_cb = mines_game_action_move_up;
        break;

    case BUTTON_BACK_RELEASE:
    case BUTTON_DOWN_RELEASE:
    case BUTTON_ENTER_RELEASE:
    case BUTTON_UP_RELEASE:
        if (MINES_TIMER_ENDED(button) && p_state->long_button_cb) {
            p_state->long_button_cb(p_state);
        } else if (p_state->short_button_cb) {
            p_state->short_button_cb(p_state);
        }

        break;
    }
}

static void mines_game_state_game_task_cursor(MinesGameState *p_state)
{
    uint8_t origin_x, origin_y;

    if (MINES_TIMER_ENDED(cursor)) {
        if (p_state->cursor_activated) {
            mines_clear_cursor(p_state);
            MINES_TIMER_START(cursor, 500);
        } else {
            MINES_TIMER_START(cursor, 500);
            p_state->cursor_activated = true;

            mines_calculate_cell_origin(
                p_state->cursor_x, p_state->cursor_y, p_state->field_width,
                p_state->field_height, &origin_x, &origin_y);

            mines_ui_draw_cursor(origin_x, origin_y, 0);

            gfx_update();
        }
    }
}

static void mines_game_state_game_task_sidebar(MinesGameState *p_state)
{
    if (MINES_TIMER_ENDED(sidebar)) {
        if (p_state->sidebar_warning_hold > 0) {
            p_state->sidebar_warning_hold--;

            display_draw_16bit_ext_bitmap(MINES_GAME_FIELD_SIDEBAR_POSITION, 0,
                                          &mines_sidebar_warning_bitmap, 0);
        } else {
            char value[3];

            display_draw_16bit_ext_bitmap(MINES_GAME_FIELD_SIDEBAR_POSITION, 0,
                                          &mines_sidebar_bitmap, 0);

            gfx_set_text_background_color(DISPLAY_WHITE, DISPLAY_BLACK);

            gfx_set_cursor(MINES_GAME_FIELD_SIDEBAR_POSITION + 7, 14);
            sprintf(value, "%d", p_state->mines_total);
            gfx_puts(value);

            gfx_set_cursor(MINES_GAME_FIELD_SIDEBAR_POSITION + 7, 37);
            sprintf(value, "%d", p_state->flags_placed);
            gfx_puts(value);

            gfx_set_cursor(MINES_GAME_FIELD_SIDEBAR_POSITION + 7, 61);
            sprintf(value, "%d", p_state->holds_placed);
            gfx_puts(value);

            gfx_update();
        }

        MINES_TIMER_START(sidebar, 1000);
    }
}

static void mines_game_state_game_task_win(MinesGameState *p_state)
{
    if (p_state->opened_count + p_state->mines_total >=
        p_state->field_width * p_state->field_height) {
        MINES_GAME_GOTO(MINES_GAME_STATE_CLEARED);
    }
}

static void mines_game_state_boot_handle(MinesGameState *p_state)
{
    display_draw_16bit_ext_bitmap(0, 0, &mines_splash_bitmap, 0);

    mines_buttons_read();
    MINES_GAME_GOTO(MINES_GAME_STATE_BOOT_SPLASH);
}

static void mines_game_state_boot_splash_handle(MinesGameState *p_state)
{
    if (mines_buttons_is_any_pushed()) {
        MINES_GAME_GOTO(MINES_GAME_STATE_MENU);
    }
}

static void mines_game_state_cleared_handle(MinesGameState *p_state)
{
    if (!p_state->cleared_rendered) {
        uint8_t origin_x, origin_y, x, y;

        mines_clear_cursor(p_state);

