nsec/nsec-badge/nrf52/src/app/game_mines.c
        for (uint8_t i = 0; i < p_state->mines_total; i++) {
            x = MINES_GAME_LIST2CELL_X(p_state->mines[i]);
            y = MINES_GAME_LIST2CELL_Y(p_state->mines[i]);

            mines_calculate_cell_origin(x, y, p_state->field_width,
                                        p_state->field_height, &origin_x,
                                        &origin_y);

            mines_ui_draw_cell_pattern(origin_x, origin_y,
                                       MINES_PATTERN_CLEARED);
        }

        p_state->cleared_rendered = true;
    }

    if (mines_buttons_is_any_pushed()) {
        p_state->cleared_rendered = false;
        MINES_GAME_GOTO(MINES_GAME_STATE_CLEARED_MSG);
    }
}

static void mines_game_state_cleared_msg_handle(MinesGameState *p_state)
{
    if (!p_state->cleared_rendered) {
        display_draw_16bit_ext_bitmap(5, 12, &mines_message_bitmap, 0);
        gfx_set_text_background_color(DISPLAY_BLACK, DISPLAY_WHITE);

        gfx_set_cursor(14, 20);
        gfx_puts("You have won!");

        gfx_set_cursor(14, 32);
        gfx_puts("You are truly a");

        gfx_set_cursor(14, 44);
        gfx_puts("master of your");

        gfx_set_cursor(14, 56);
        gfx_puts("own mind!");
        gfx_update();

        p_state->cleared_rendered = true;
    }

    if (mines_buttons_is_any_pushed()) {
        p_state->cleared_rendered = false;
        MINES_GAME_GOTO(MINES_GAME_STATE_POST_MENU);
    }
}

static void mines_game_state_controls_handle(MinesGameState *p_state)
{
    if (!p_state->controls_rendered) {
        display_draw_16bit_ext_bitmap(0, 0, &mines_controls_bitmap, 0);
        p_state->controls_rendered = true;
    }

    if (mines_buttons_is_any_pushed()) {
        p_state->controls_rendered = false;
        MINES_GAME_GOTO(MINES_GAME_STATE_MENU);
    }
}

static void mines_game_state_draw_canvas_handle(MinesGameState *p_state)
{
    uint8_t origin_x, origin_y;

    uint8_t height = p_state->field_height;
    uint8_t width = p_state->field_width;

    display_draw_16bit_ext_bitmap(0, 0, &mines_background_bitmap, 0);
    display_draw_16bit_ext_bitmap(MINES_GAME_FIELD_SIDEBAR_POSITION, 0,
                                  &mines_sidebar_bitmap, 0);

    mines_calculate_cell_origin(0, 0, width, height, &origin_x, &origin_y);

    gfx_fill_rect(origin_x - 4, origin_y - 4, width * MINES_GAME_FIELD_CELL + 7,
                  height * MINES_GAME_FIELD_CELL + 7, 0x0063);

    gfx_fill_rect(origin_x - 2, origin_y - 2, width * MINES_GAME_FIELD_CELL + 3,
                  height * MINES_GAME_FIELD_CELL + 3, 0x11cc);

    gfx_fill_rect(origin_x, origin_y, width * MINES_GAME_FIELD_CELL,
                  height * MINES_GAME_FIELD_CELL, DISPLAY_WHITE);

    for (uint8_t i = 0; i < width; i++) {
        for (uint8_t j = 0; j < height; j++) {
            mines_calculate_cell_origin(i, j, width, height, &origin_x,
                                        &origin_y);
            mines_ui_draw_cell_pattern(origin_x, origin_y, MINES_PATTERN_BLANK);
        }
    }

    gfx_update();

    MINES_GAME_GOTO(MINES_GAME_STATE_GAME);
}

static void mines_game_state_explosion_handle(MinesGameState *p_state)
{
    if (!p_state->explosion_rendered) {
        uint8_t origin_x, origin_y, x, y;

        mines_calculate_cell_origin(p_state->cursor_x, p_state->cursor_y,
                                    p_state->field_width, p_state->field_height,
                                    &origin_x, &origin_y);

        nrf_delay_ms(500);
        mines_ui_draw_cell_pattern(origin_x, origin_y, MINES_PATTERN_BOOM);
        nrf_delay_ms(500);

        for (uint8_t i = 0; i < p_state->mines_total; i++) {
            x = MINES_GAME_LIST2CELL_X(p_state->mines[i]);
            y = MINES_GAME_LIST2CELL_Y(p_state->mines[i]);

            if (x == p_state->cursor_x && y == p_state->cursor_y) {
                continue;
            }

            mines_calculate_cell_origin(x, y, p_state->field_width,
                                        p_state->field_height, &origin_x,
                                        &origin_y);

            mines_ui_draw_cell_pattern(origin_x, origin_y, MINES_PATTERN_MINE);
        }

        p_state->explosion_rendered = true;
    }

    if (mines_buttons_is_any_pushed()) {
        p_state->explosion_rendered = false;
        MINES_GAME_GOTO(MINES_GAME_STATE_EXPLOSION_MSG);
    }
}

static void mines_game_state_explosion_msg_handle(MinesGameState *p_state)
{
    if (!p_state->explosion_rendered) {
        display_draw_16bit_ext_bitmap(5, 12, &mines_message_bitmap, 0);
        gfx_set_text_background_color(DISPLAY_BLACK, DISPLAY_WHITE);
        gfx_set_cursor(46, 39);
        gfx_puts("BOOM!");
        gfx_update();

        p_state->explosion_rendered = true;
    }

    if (mines_buttons_is_any_pushed()) {
        p_state->explosion_rendered = false;
        MINES_GAME_GOTO(MINES_GAME_STATE_MENU);
    }
}

#ifdef NSEC_FLAVOR_CONF
static void mines_game_state_flag_handle(MinesGameState *p_state)
{
    MINES_GAME_GOTO(MINES_GAME_STATE_EXIT);
}
#else
static void mines_game_state_flag_handle(MinesGameState *p_state)
{
    gfx_fill_rect(0, 0, DISPLAY_HEIGHT, DISPLAY_WIDTH, DISPLAY_BLACK);

    gfx_draw_xbitmap(15, 35, mines_flag_bitmap, mines_flag_bitmap_width,
                     mines_flag_bitmap_height, DISPLAY_WHITE);

    gfx_update();

    while (true) {
        __asm__("NOP");
    }
}
#endif

static void mines_game_state_game_handle(MinesGameState *p_state)
{
    mines_game_state_game_task_buttons(p_state);
    mines_game_state_game_task_cursor(p_state);
    mines_game_state_game_task_sidebar(p_state);
    mines_game_state_game_task_win(p_state);
}

static void mines_game_state_init_game_handle(MinesGameState *p_state)
{
    uint8_t value;

    memset(p_state->flags, 255, MINES_GAME_LIST_LIMIT);
    memset(p_state->holds, 255, MINES_GAME_LIST_LIMIT);
    memset(p_state->mines, 255, MINES_GAME_LIST_LIMIT);
    memset(p_state->opened, 255, MINES_GAME_LIST_LIMIT);

    p_state->flags_placed = 0;
    p_state->holds_placed = 0;
    p_state->opened_count = 0;

