nsec/nsec-badge/nrf52/src/app/game_mines.c
    p_state->field_width =
        mines_difficulty_levels[p_state->current_difficulty][0];
    p_state->field_height =
        mines_difficulty_levels[p_state->current_difficulty][1];
    p_state->mines_total =
        mines_difficulty_levels[p_state->current_difficulty][2];

    for (uint8_t i = 0; i < p_state->mines_total; i++) {
        do {
            value = nsec_random_get_byte(MINES_GAME_FIELD_SIZE - 1);
        } while (mines_game_has_mine_at(p_state, value));

        p_state->mines[i] = value;
    }

    do {
        value = nsec_random_get_byte(MINES_GAME_FIELD_SIZE - 1);
    } while (mines_game_has_mine_at(p_state, value));

    p_state->cursor_activated = 0;
    p_state->cursor_x = MINES_GAME_LIST2CELL_X(value);
    p_state->cursor_y = MINES_GAME_LIST2CELL_Y(value);

    p_state->long_button_cb = NULL;
    p_state->short_button_cb = NULL;

    MINES_TIMER_CANCEL(button);
    MINES_TIMER_CANCEL(cursor);
    MINES_TIMER_CANCEL(sidebar);

    MINES_GAME_GOTO(MINES_GAME_STATE_DRAW_CANVAS);
}

static void mines_game_state_manual_handle(MinesGameState *p_state)
{
    if (!p_state->manual_rendered) {
        const char strings[3][100] = {
            "   Your mind is a tool.\n   The more you use it,\n   the better "
            "you are\n   with it.",
            "   Schizophrenia and\n   dementia related to\n   the Beyond "
            "Reality are\n   rare, but possible.",
            "   Learn to avoid them\n   by playing this\n   fun game!"};

        display_draw_16bit_ext_bitmap(0, 0, &mines_background_bitmap, 0);

        gfx_set_cursor(0, 22);
        gfx_set_text_background_color(DISPLAY_WHITE, DISPLAY_WHITE);
        gfx_puts(strings[p_state->manual_position]);
        gfx_update();

        p_state->manual_rendered = true;
    }

    if (mines_buttons_is_any_pushed()) {
        p_state->manual_position++;
        p_state->manual_rendered = false;

        if (p_state->manual_position >= 3) {
            p_state->manual_position = 0;
            p_state->manual_rendered = false;

            MINES_GAME_GOTO(MINES_GAME_STATE_MENU);
        }
    }
}

static void mines_game_state_menu_handle(MinesGameState *p_state)
{
    uint8_t cursor_x = 0, cursor_y = 0;

    uint8_t menu[] = {MINES_GAME_STATE_SELECT_LEVEL, MINES_GAME_STATE_CONTROLS,
                      MINES_GAME_STATE_MANUAL, MINES_GAME_STATE_EXIT};

    if (!p_state->menu_rendered) {
        display_draw_16bit_ext_bitmap(0, 0, &mines_menu_bitmap, 0);

        switch (p_state->menu_position) {
        case 0:
            cursor_x = 45;
            cursor_y = 11;
            break;

        case 1:
            cursor_x = 45;
            cursor_y = 30;
            break;

        case 2:
            cursor_x = 45;
            cursor_y = 47;
            break;

        case 3:
            cursor_x = 45;
            cursor_y = 65;
            break;
        }

        gfx_fill_triangle(cursor_x, cursor_y, cursor_x + 4, cursor_y + 2,
                          cursor_x, cursor_y + 4, DISPLAY_WHITE);
        gfx_update();

        p_state->menu_rendered = true;
    }

    switch (mines_buttons_read()) {
    case BUTTON_DOWN:
        p_state->menu_position =
            p_state->menu_position == 3 ? 0 : p_state->menu_position + 1;
        p_state->menu_rendered = false;
        break;

    case BUTTON_ENTER:
        p_state->menu_rendered = false;
        MINES_GAME_GOTO(menu[p_state->menu_position]);
        break;

    case BUTTON_UP:
        p_state->menu_position =
            p_state->menu_position == 0 ? 3 : p_state->menu_position - 1;
        p_state->menu_rendered = false;
        break;
    }
}

#ifdef NSEC_FLAVOR_CONF
static void mines_game_state_post_menu_handle(MinesGameState *p_state)
{
    MINES_GAME_GOTO(MINES_GAME_STATE_MENU);
}
#else
static void mines_game_state_post_menu_handle(MinesGameState *p_state)
{
    display_draw_16bit_ext_bitmap(5, 12, &mines_message_bitmap, 0);

    gfx_set_cursor(10, 39);
    gfx_set_text_background_color(DISPLAY_BLACK, DISPLAY_WHITE);

    switch (p_state->current_difficulty) {
    case 0:
        gfx_puts(MINES_FLAG_PART1);
        break;

    case 1:
        gfx_puts(MINES_FLAG_PART2);
        break;

    case 2:
        gfx_puts(MINES_FLAG_PART3);
        break;
    }

    nrf_delay_ms(5000);
    MINES_GAME_GOTO(MINES_GAME_STATE_MENU);
}
#endif

static void mines_game_state_select_level_handle(MinesGameState *p_state)
{
    if (!p_state->select_level_rendered) {
        MINES_TIMER_START(select_level_highlight, 300);

        switch (p_state->current_difficulty) {
        case 0:
            display_draw_16bit_ext_bitmap(0, 0, &mines_level_1_bitmap, 0);
            break;

        case 1:
            display_draw_16bit_ext_bitmap(0, 0, &mines_level_2_bitmap, 0);
            break;

        case 2:
            display_draw_16bit_ext_bitmap(0, 0, &mines_level_3_bitmap, 0);
            break;
        }

        p_state->select_level_rendered = true;
    }

    if (MINES_TIMER_ENDED(select_level_highlight)) {
        if (p_state->select_level_highlight) {
            p_state->select_level_highlight = false;
            p_state->select_level_rendered = false;
        } else {
            p_state->select_level_highlight = true;

            switch (p_state->current_difficulty) {
            case 0:
                display_draw_16bit_ext_bitmap(11, 37,
                                              &mines_level_1_active_bitmap, 0);
                break;

            case 1:
                display_draw_16bit_ext_bitmap(11, 37,
                                              &mines_level_2_active_bitmap, 0);
                break;

            case 2:
                display_draw_16bit_ext_bitmap(11, 37,
                                              &mines_level_3_active_bitmap, 0);
                break;
            }

            MINES_TIMER_START(select_level_highlight, 300);
        }
    }

    switch (mines_buttons_read()) {
    case BUTTON_BACK:
        MINES_GAME_GOTO(MINES_GAME_STATE_MENU);
        p_state->select_level_highlight = false;
        p_state->select_level_rendered = false;
        break;

    case BUTTON_DOWN:
        p_state->current_difficulty = p_state->current_difficulty == 2
                                          ? 0
                                          : p_state->current_difficulty + 1;
        p_state->select_level_highlight = false;
        p_state->select_level_rendered = false;
        break;

    case BUTTON_ENTER:
        MINES_GAME_GOTO(MINES_GAME_STATE_INIT_GAME);
        p_state->select_level_highlight = false;
        p_state->select_level_rendered = false;
        break;

    case BUTTON_UP:
        p_state->current_difficulty = p_state->current_difficulty == 0
                                          ? 2
                                          : p_state->current_difficulty - 1;
        p_state->select_level_highlight = false;
        p_state->select_level_rendered = false;
        break;
    }
}

static void mines_timer_handle(void *p_context)
{
    MinesGameState *p_state = (MinesGameState *)p_context;

    if (!MINES_TIMER_ENDED(button))
        MINES_TIMER_TICK(button);

    if (!MINES_TIMER_ENDED(cursor))
        MINES_TIMER_TICK(cursor);

    if (!MINES_TIMER_ENDED(select_level_highlight))
        MINES_TIMER_TICK(select_level_highlight);

    if (!MINES_TIMER_ENDED(sidebar))
        MINES_TIMER_TICK(sidebar);
}

void mines_application(void (*service_device)())
{
    MinesGameState state = {.cleared_rendered = false,
                            .controls_rendered = false,
                            .current_difficulty = 0,
                            .current_state = MINES_GAME_STATE_BOOT,
                            .cursor_activated = false,
                            .cursor_x = 0,
                            .cursor_y = 0,
                            .explosion_rendered = false,
                            .field_height = 0,
                            .field_width = 0,
                            .flags = {},
                            .flags_placed = 0,
                            .holds = {},
                            .holds_placed = 0,
                            .manual_position = 0,
                            .menu_position = 0,
                            .menu_rendered = false,
                            .menu_rendered = false,
                            .mines = {},
                            .mines_total = 0,
                            .opened = {},
                            .opened_count = 0,
                            .select_level_highlight = false,
                            .select_level_rendered = false};

    app_timer_create(&mines_timer_id, APP_TIMER_MODE_REPEATED,
                     mines_timer_handle);
    app_timer_start(mines_timer_id, APP_TIMER_TICKS(MINES_TIMER_INTERVAL),
                    &state);
    nsec_controls_add_handler(mines_buttons_handle);

    while (application_get() == mines_application) {
        service_device();

        switch (state.current_state) {
        case MINES_GAME_STATE_BOOT:
            mines_game_state_boot_handle(&state);
            break;

        case MINES_GAME_STATE_BOOT_SPLASH:
            mines_game_state_boot_splash_handle(&state);
            break;

        case MINES_GAME_STATE_CLEARED:
            mines_game_state_cleared_handle(&state);
            break;

        case MINES_GAME_STATE_CLEARED_MSG:
            mines_game_state_cleared_msg_handle(&state);
            break;

        case MINES_GAME_STATE_CONTROLS:
            mines_game_state_controls_handle(&state);
            break;

        case MINES_GAME_STATE_DRAW_CANVAS:
            mines_game_state_draw_canvas_handle(&state);
            break;

        case MINES_GAME_STATE_EXPLOSION:
            mines_game_state_explosion_handle(&state);
            break;

        case MINES_GAME_STATE_EXIT:
            application_clear();
            break;

        case MINES_GAME_STATE_EXPLOSION_MSG:
            mines_game_state_explosion_msg_handle(&state);
            break;

        case MINES_GAME_STATE_FLAG:
            mines_game_state_flag_handle(&state);
            break;

        case MINES_GAME_STATE_GAME:
            mines_game_state_game_handle(&state);
            break;

        case MINES_GAME_STATE_INIT_GAME:
            mines_game_state_init_game_handle(&state);
            break;

        case MINES_GAME_STATE_MANUAL:
            mines_game_state_manual_handle(&state);
            break;

        case MINES_GAME_STATE_MENU:
            mines_game_state_menu_handle(&state);
            break;

        case MINES_GAME_STATE_POST_MENU:
            mines_game_state_post_menu_handle(&state);
            break;

        case MINES_GAME_STATE_SELECT_LEVEL:
            mines_game_state_select_level_handle(&state);
            break;

        default:
            state.current_state = MINES_GAME_STATE_EXIT;
        }
    }

    app_timer_stop(mines_timer_id);
    nsec_controls_suspend_handler(mines_buttons_handle);

    application_clear();
}
